{
  "corpusclinical": {
    "name": "Аннотированный корпус клинических текстов",
    "short_description": "Корпус содержит медицинские истории более 60 пациентов НЦЗД с аллергическими и пульмонологическими расстройствами и заболеваниями, включая выписные эпикризы из истории болезни, заключения радиологических, эхокардиографических и ультразвуковых исследований, а также назначения и рекомендации различных врачей.",
    "description": "<p>Корпус был создан совместно Институтом системного анализа ФИЦ ИУ РАН и <a href=\"http://www.nczd.ru/\" target=\"_blank\"> ФГБНУ \"Научный центр здоровья детей\" (НЦЗД)</a>.</p><p>Корпус содержит медицинские истории более 60 пациентов НЦЗД с аллергическими и пульмонологическими расстройствами и заболеваниями, включая выписные эпикризы из истории болезни, заключения радиологических, эхокардиографических и ультразвуковых исследований, а также назначения и рекомендации различных врачей. Все документы в корпусе обезличены: удалены имена и изменены даты.</p><p>Схема разметки частично схожа со схемой, представленной в <a href=\"https://drive.google.com/file/d/0B7oJZ-fwZvH5ZXFRTGl6U3Z6cVE/edit\" target=\"_blank\"> CLEF eHealth 2014 Task 2</a> и включает такие аннотации как заболевания, симптомы, тяжесть заболевания, течение болезни, назначения, медикаменты, части тела, а так же различные свойства аннотаций и отношения между ними. Подробнее ознакомиться со схемой разметки можно в <a href=\"/corpora/clinical/guidelines_v.1.6.1.pdf\">руководстве</a></p><p>Тексты были размечены экспертами из НЦЗД. Разметка проводилась при помощи инструмента разметки <a href=\"http://brat.nlplab.org/\" target=\"_blank\"> Brat </a>.<br>Пример размеченного текста приведен на рисунке.</p><img class=\"image\" alt=\"изображение\" src=\"../../assets/imgs/datasets/medicine_corpora.png\" align=\"middle\"><p> На данный момент корпус состоит из 112 полных текстов и почти 45 000 токенов. Размечено 7600 сущностей и более 4000 свойств и связей.</p>",
    "link": "Корпус можно получить, обратившись по почте <a href=\"mailto:nlp@isa.ru\" target=\"_top\">nlp@isa.ru</a>.",
    "footer": "Исследование поддержано грантом 13-04-12062 Российского фонда фундаментальных исследований "
  },
  "anaphora": {
    "name": "Анафорически аннотированный корпус текстов ",
    "short_description": "Корпус состоит из 17 текстов из Библиотеки Мошкова и 34 текстов из корпуса Синтаксически размеченного корпуса русского языка (СинТагРус) и содержит в общей сложности 910 анафорических пар. Размечалась только местоименная анафора, выделялись личные местоимения 3-го лица, притяжательные, указательные и относительные местоимения. ",
    "description": "<p>Корпус состоит из 17 текстов, взятых из <a href=\"http://www.lib.ru/\" target=\"blank\">Библиотеки Мошкова,</a>, и 34 текстов - из <a href=\"http://www.ruscorpora.ru/instruction-syntax.html\" target=\"blank\">Синтаксически размеченного корпуса русского языка (СинТагРус)</a> и содержит в общей сложности 910 анафорических пар. В составе корпуса тексты трех основных типов: <ol><li>русская и зарубежная проза;</li><li>научно-популярные и общественно-политические статьи из журналов;</li><li>тексты новостных лент, опубликованные в сети Интернет.</li></ol></p><p>Размечалась только местоименная анафора, выделялись личные местоимения 3-го лица, притяжательные, указательные и относительные местоимения.</p><h4>Схема разметки</h4><p>Размечалось каждое местоимение, для которого в тексте существует антецедент. В качестве антецедента выбиралась ближайшая именная группа, предшествующая антецеденту, или местоимение, для которого уже найден антецедент. В случае, если для местоимения множественного числа антецедентом служили несколько именных групп единственого или множественного числа, каждая из именных групп добавлялась в связь с анафором.</p>",
    "link": "<p>Корпус можно получить, обратившись по <a href=\"mailto:nlp@isa.ru\" target=\"_top\">nlp@isa.ru</a>. Для получения корпуса требуется принять лицензионное соглашение, которое будет выслано Вам в ответном письме.<p>",
    "footer": ""
  }
}

