{
  "nlp-isa": {
    "name": "Новый сайт",
    "year": "2018",
    "short_description": "Обновлённый сайт лаборатории",
    "description": "большое описание",
    "demo": [],
    "datasets": [],
    "publications": []
  },
  "anaphora": {
    "name": "Разрешение анафоры",
    "year": "2014",
    "short_description": "Разрешение анафоры является важной задачей искусственного интеллекта в области обработки естественного языка, направленной на реализацию полноценной системы понимания текста. Цель этой задачи заключается в совмещении семантических сетей отдельных предложений в общую семантическую сеть текста, в которой установлены связи между объектами, упоминаемыми на протяжении целого дискурса.<br>На первом этапе исследования были изучены два вопроса:<ol><li>Какой метод разрешения местоименной анафоры эффективней: метод машинного обучения или метод, основанный на правилах?</li><li>Как влияют на качество разрешения анафоры семантические признаки?</li></ol>",
    "description": "<p>Исследовалась только местоименная анафора. Сравнивались статистический метод обучения, основанный на машине опорных векторов, и индуктивный метод, основанный на построении деревьев решений. В качестве признаков обучения использовались морфологические, синтаксические и семантические признаки, получаемые с помощью лингвистического анализатора ИСА РАН. В качестве обучающих и проверочных данных использовались три набора данных: собственный размеченный корпус (<a href=\"/index.php/component/portal/?view=clinical\">подробнее</a>), обучающий и тестовый корпуса, предоставленные организаторами Форума по оценке систем лингвистического анализа текстов, проводимого в рамках конференции <a href=\"http://www.dialog-21.ru/\" target=\"blank\">Диалог-2014</a>. Для определения значимости групп признаков проводилось несколько экспериментов по обучению с различными наборами признаков. Первый набор признаков включал морфологические и синтаксические признаки, во втором наборе к ним добавлялись семантические признаки.</p><p>Задача разрешения местоименной анафоры ставилась как задача распознавания правильных пар «анафор-антецедент» на основе анализа прецедентов. Множество прецедентов (обучающих примеров) строилось по размеченному корпусу. Поиск гипотетических антецедентов ограничивался определенным количеством слов, которое определялось эмпирически в ходе экспериментов.</p><h3>Результаты экспериментов</h3><p>В результате предварительных экспериментов было выявлено, что одним из наиболее важных критериев, влияющих на полноту и качество автоматизированного разрешения анафоры, является расстояние в словах, ограничивающее зону поиска гипотетического антецедента. Для каждого корпуса было построено распределение количества анафорических пар по удаленности антецедента от анафора в словах. На основе данных распределений были вычислены расстояния, которые покрывают 90% пар. Поиск гипотетических антецедентов в соответствующих корпусах выполнялся в пределах полученных значений расстояний как при обучении, так и при проверке качества методов.</p><p>Результаты экспериментов показали, что оба используемых метода обучения выдают приемлемые результаты. Метод опорных векторов во всех экспериментах, за исключением двух, показал по сравнению с деревьями решений результаты лучшие на величину от 0.1% до 13.2% точности. Обучение с набором семантических признаков для всех методов во всех экспериментах показало повышение точности обучения по сравнению с набором без семантических признаков на величину от 0.1% до 6.6%. Наилучший результат точности разрешения анафоры в 61% был достигнут методом SVM на наборе с семантическими признаками.</p><p>Исследование планируется продолжить и в дальнейшем оно будет направлено на расширение пространства признаков и совершенствование метода распознавания потенциальных антецедентов.</p>",
    "publications": ["Kamenskaya M.A, Khramoin I.V., Smirnov I.V. Data-driven methods for anaphora resolution of russian texts //Computational Linguistics and Intellectual Technologies: Papers from the Annual International Conference “Dialogue” (2014). Issue 13 (20). – 2014.  – pp. 134-136. (<a href=\"http://www.dialog-21.ru/digests/dialog2014/materials/pdf/Kamenskaya%D0%9C%D0%90.pdf\" target=\"blank\">читать</a>)", "Каменская М.А., Храмоин И.В. Влияние семантических признаков на качество разрешения местоименной анафоры //Труды III Всероссийской научной конференции молодых ученых с международным участием «Теория и практика системного анализа». – 2014. – Том II. – C. 157-163. "],
    "demo": "",
    "datasets": ""
  },
  "discourse": {
    "name": "Дискурсивный анализ текстов на русском языке",
    "year": "2015",
    "short_description": "Настоящий проект направлен на исследование методов дискурсивного анализа текстов, применение которых в автоматических системах обработки естественного языка повышает качество решения таких задач как машинный перевод, автоматическое реферирование, анализ тональности, генерация текстов и другие. В качестве модели представления дискурсивной структуры текста используется Теория риторических структур.Также в рамках проекта создается русскоязычный дискурсивный корпус, на основе которого будут исследоваться формальные, функциональные и семантические принципы выражения конкретных дискурсивных отношений в языке.",
    "description": "<p>Как известно, качество решения таких задач компьютерной лингвистики, как машинный перевод, автоматическое реферирование текстов, определение связности текста, все еще не достигло желаемого уровня. Поэтому в последнее время многие исследователи стали обращаться к изучению новых аспектов текста. Стала очевидной, например, необходимость исследования не только того, как слова строятся в предложения, но и как предложения выстраиваются в единый текст, т.е. структуры всего текста. Этой проблеме посвящен дискурсивный анализ текста, которому среди зарубежных ученых уделяется все больше внимания. В то же время в России почти не проводится исследований в этой области.</p><h3>Результаты проекта</h3><p>Исследована возможность адаптации Теории риторических структур для русского языка.<p></p>Многочисленные эксперименты в области применения дискурсивного анализа свидетельствуют о его универсальности и возможности применения к самым разным языкам. На сегодняшний день существуют дискурсивные корпуса для английского, испанского, немецкого, чешского, греческого, китайского и других языков.<p></p>Модифицирован список отношений, которыми могут быть связаны неделимые дискурсивные единицы (финитные клаузы, деепричастные обороты, некоторые причастные обороты и т.д.) в русском языке. Разработано <a href=\" / projects / discourse / manual.v1.pdf \">руководство</a>  по разметке текстов, в котором зафиксировано каждое отношение с подробным описанием его значения, семантической составляющей ядерной компоненты и сателлита, а также конкретными примерами. Также в данном руководстве описаны принципы выделения элементарных дискурсивных единиц.</p><p>Идет разметка корпуса <a href=\"http: //www.ruscorpora.ru/instruction-syntax.html\" target=\"blank\">СинТагРус</a> На данный момент размечено 10 текстов, что составляет 1200 элементарных дискурсивных единиц. Параллельно на базе данного корпуса исследуются лексические маркеры дискурсивных отношений, одни из которых имеют однозначную корреляцию с определенным отношением, другие – менее явную.</p>",
    "demo": "",
    "datasets": "",
    "publications": ["Кобозева М.В. Принципы риторической разметки текстов на русском языке // Информационно-телекоммуникационные технологии и математическое моделирование высокотехнологичных систем: материалы Всероссийской конференции с международным участием. Москва: РУДН, 2016. – с.153-156.", "Ананьева М.И., Кобозева М.В. Дискурсивный анализ в задачах обработки естественного языка // Конференция «Информатика, управление и системный анализ», ИУСА, 2016, в печати.", "Ананьева М.И., Кобозева М.В. Разработка корпуса текстов на русском языке с разметкой на основе Теории риторических структур // Труды Международного семинара Диалог. – 2016, в печати."]
  },
  "extraction": {
    "name": "Извлечение информации из научных текстов",
    "year": "",
    "short_description": "Проект направлен на исследование и разработку методов извлечения целевой информации из первичных научных публикаций – научных статей, монографий, авторефератов диссертаций, трудов конференций и др. Разрабатываемые методы будут ориентированы прежде всего на выявление в научных публикациях результатов научных исследований и введенных авторами новых понятий. Отличительная особенность предлагаемых подходов состоит в использовании реляционно- ситуационного анализа научных текстов и принципов активного и инкрементального машинного обучения с применением композиции индуктивных и статистических методов обучения. Предполагается создание размеченного корпуса научных текстов для обучения и проверки разработанных методов.",
    "description": "",
    "demo": "",
    "datasets": "",
    "publications": ""
  },
  "sintsemanalysis": {
    "name": "Синтактико-семантический анализ",
    "year": "2012",
    "short_description": "Проект направлен на создание семантико-синтаксического анализатора, объединяющего фазы синтаксического и семантического анализа текстов на естественном языке в одной процедуре. Исследованы взаимодействие синтаксиса и семантики и возможность интеграции семантического и синтаксического анализа в рамках единого семантико-синтаксического анализатора. Разработан метод автоматического семантико-синтаксического анализа текстов на естественном языке, выполняющий синтаксический и семантический анализ текстов на основе единого подхода, в одной процедуре с использованием единой структуры данных.",
    "description": "<p>Современные исследования естественного языка подвели к идее о неразрывной связи синтаксиса и семантики, в то же время в существующих лингвистических анализаторах эти две фазы принципиально разделены, что противоречит естественному строю языка. В проекте исследовано взаимодействие синтаксиса и семантики и решена задача их интеграции в рамках единого семантико-синтаксического анализатора.</p><h4>Результаты проекта</h4><p>Исследованы взаимодействие синтаксиса и семантики и возможность интеграции семантического и синтаксического анализа в рамках единого семантико-синтаксического анализатора.</p><p>Разработан метод автоматического семантико-синтаксического анализа текстов на естественном языке, выполняющий синтаксический и семантический анализ текстов на основе единого подхода, в одной процедуре с использованием единой структуры данных.</p><p>Разработаны экспериментальные программные средства автоматического семантико-синтаксического анализа текста на естественном языке, реализующие разработанный метод. Основным компонентом программных средств является анализатор MaltParser. Это обучаемый анализатор, он принимает на вход текст с разметкой, на выходе получается обученная модель, которая применяется для анализа новых текстов. Получаемая модель отделена от алгоритма анализа, её можно использовать с другими реализациями анализатора. При обучении на вход анализатору подаётся текст с синтаксической и семантической разметкой, при этом семантическая разметка является разновидностью синтаксической разметки, т.е. можно говорить о семантико-синтаксической разметке текста. Обученная модель позволяет выполнять семантический и синтаксический анализ текстов за один проход.<p></p>Выполнены экспериментальные исследования разработанного метода автоматического семантико-синтаксического анализа текстов. Для экспериментальной проверки разработанного метода семантико-синтаксического анализа текстов использовался Синтаксически размеченный корпус русского языка <a href=\"http://www.ruscorpora.ru/instruction-syntax.html\" target=\"blank\">СинТагРус</a>, разработанный в <a href=\"http://iitp.ru/ru/about\" target=\"blank\">ИППИ РАН</a> . Данный корпус содержит морфологическую и синтаксическую разметку со снятой многозначностью. В корпус СинТагРус с помощью существующего словарного семантического анализатора была добавлена семантическая разметка, которая указывает тип семантико-синтаксической связи (семантическую роль) между предикатными словами и синтаксемами. Таким образом были получены обучающие данные для анализатора. Для оценки качества работы разработанного метода семантико-синтаксического анализа был создан небольшой подкорпус СинТагРус с семантической разметкой, выполненной вручную экспертом лингвистом. Данный проверочный корпус («золотой стандарт») содержит 27 текстов, 1730 предложений, 3875 слов с семантическими пометами.</p><p>Эксперименты показали работоспособность подхода, объединяющего синтаксический и семантический виды анализа. Максимальная аккуратность синтаксического анализа составила 88.2%, что соответствует уровню качества известных синтаксических анализаторов. Максимальная точность установления семантических значений составила 86.8% при полноте 60.1%, F-мера 71.0%, что так же соответствует уровню качества известных SRL анализаторов. Эксперименты показали, что F-мера установления семантических значений при совместном семантико-синтаксическом анализе примерно на 1% выше аналогичного показателя при последовательном и раздельном синтаксическом и семантическом анализе, что является значимым результатом для данной задачи.</p>",
    "demo": "",
    "datasets": "",
    "publications": ["И.В. Смирнов, А.О. Шелманов. Семантико-синтаксический анализ естественных языков. Часть I. Обзор методов синтаксического и семантического анализа текстов // Журнал \"Искусственный интеллект и принятие решений\". М.: ИСА РАН – 2013. – No1. – С. 41-54. (<a href=\"http://aidt.ru/index.php?option=com_content&amp;view=article&amp;id=318:318&amp;catid=148:2013-03-13-14-05-07&amp;Itemid=150&amp;lang=en\" target=\"blank\">читать</a>)", "И.В. Смирнов, А.О. Шелманов, Е.С. Кузнецова, И.В. Храмоин. Семантико-синтаксический анализ естественных языков. Часть II. Метод семантико-синтаксического анализа текстов // Журнал \"Искусственный интеллект и принятие решений\". М.: ИСА РАН – 2014. – No1. – С. 11-24. (<a href=\"http://aidt.ru/index.php?option=com_content&amp;view=article&amp;id=349:349&amp;catid=167:2014-03-04-13-19-22&amp;Itemid=147&amp;lang=en\" target=\"blank\">читать</a>)", "Shelmanov A. O., Smirnov I. V. Methods for Semantic Role Labeling of Russian Texts // Computational Linguistics and Intellectual Technologies: Papers from the Annual International Conference \"Dialogue\" (2014). Issue 13 (20) – 2014. – pp. 607-619. (<a href=\"http://www.dialog-21.ru/digests/dialog2014/materials/pdf/ShelmanovAOSmirnovIV.pdf\" target=\"blank\">читать</a>)"]
  },
  "infretrievalclinical": {
    "name": "Извлечение информации из медицинских текстов",
    "year": "2013",
    "short_description": "В области обработки текстов на ЕЯ выделилось отдельное актуальное быстроразвивающееся научное направление, которое занимается проблемой анализа клинических текстов. В рамках этого направления разрабатываются специализированные системы, решающие задачи извлечения информации из клинических текстов и ее структурирования. Информация, полученная из текстов, может существенно обогатить базы знаний и данных, на основе которых работают медицинские системы поддержки принятия решений, что, в конечном счете, может повысить их эффективность. ",
    "description": "<p>Медицинские организации генерируют огромный объем неструктурированной информации, которая содержится в текстах на естественном языке (ЕЯ). Большинство историй болезни, анамнезов, эпикризов, а также отчетов о проведении клинических мероприятий: операций, анализов и обследований, таких как рентгеновские, ультразвуковые исследования, записываются в виде текстов на ЕЯ. Эти тексты содержат много полезной информации, которую необходимо извлечь и структурировать. В области обработки текстов на ЕЯ выделилось отдельное актуальное быстроразвивающееся научное направление, которое занимается проблемой анализа клинических текстов. В рамках этого направления разрабатываются специализированные системы, решающие задачи извлечения информации из клинических текстов и ее структурирования. Информация, полученная из текстов, может существенно обогатить базы знаний и данных, на основе которых работают медицинские системы поддержки принятия решений, что, в конечном счете, может повысить их эффективность. Большинство существующих методов и систем анализа медицинских текстов работают только с английским языком, системы анализа медицинских текстов на русском языке отсутствуют.</p><h3>Результаты проекта</h3><p>Разработаны следующие методы:<ol><li>метод поиска медицинских терминов в тексте по набору кодификаторов (упоминания заболеваний, симптомов, лекарств, медицинских процедур и др.);</li><li>метод распознавания в тексте конструкций, указывающих на отсутствие заболевания у пациента;</li><li>метод распознавания в тексте конструкций, указывающих на то, что заболевание относится не к пациенту (а, например, к его родственнику);</li><li>метод распознавания конструкций, указывающих на тяжесть протекания заболевания, а также метод нормализации этих конструкций;</li><li>метод распознавания конструкций, указывающих на течение заболевания, а также метод нормализации этих конструкций;</li><li>метод сопоставления заболеваний и областей тела, к которым относятся заболевания.</li></ol></p><p>Создан корпус медицинских текстов, содержащий 50 деперсонализованных историй болезни пациентов педиатрического центра. В текстах корпуса размечены следующие сущности: заболевания / нарушения, области тела, медицинские процедуры, лекарственные препараты, симптомы и др. Ознакомиться подробнее с корпусом можно <a href=\"http://nlp.isa.ru/datasets/clinical\">здесь</a>.</p><p>Разработанные методы будут использованы в комплексной системе интеллектуальной обработки данных.</p><p>Выполнены предварительные экспериментальные исследования разработанного метода на созданном корпусе.</p>",
    "demo": "",
    "datasets": "",
    "publications": ["Shelmanov A. O., Smirnov I. V., Vishneva E. A. Information extraction from clinical texts in Russian // Computational Linguistics and Intellectual Technologies: Papers from the Annual International Conference \"Dialogue\" (2015). Issue 14 (21). – 2015. – V1. – pp. 560-572. (<a href=\"http://www.dialog-21.ru/digests/dialog2015/materials/pdf/ShelmanovAOetal.full.pdf\" target=\"blank\">читать</a>)", "А.А.Баранов, Л.С. Намазова-Баранова, И.В. Смирнов, Д.А. Девяткин, А.О. Шелманов, Е.А. Вишнева, Е.В. Антонова, В.И. Смирнов, А.В. Латышев. Методы и средства комплексного интеллектуального анализа медицинских данных // Труды ИСА РАН. – 2015 – No2. – С. 81-93. (<a href=\"http://www.isa.ru/proceedings/images/documents/2015-65-2/t-15-2_81-93.pdf\" target=\"blank\">читать</a>)"]
  },
  "empty": {
    "name": "",
    "year": "",
    "short_description": "",
    "description": "",
    "demo": "",
    "datasets": "",
    "publications": ""
  }
}
